libretiny-eu/libretiny/boards/wr2e/variant.h
/* This file was auto-generated from wr2e.json using boardgen */

#pragma once

#include <WVariant.h>

// clang-format off

// Pins
// ----
#define PINS_COUNT         8
#define NUM_DIGITAL_PINS   7
#define NUM_ANALOG_INPUTS  2
#define NUM_ANALOG_OUTPUTS 0

// Analog pins
// -----------
#define PIN_A0 1u     // PA_19
#define PIN_A1 7u     // AD_2
#define A0     PIN_A0
#define A1     PIN_A1

// SPI Interfaces
// --------------
#define SPI_INTERFACES_COUNT 0

// Wire Interfaces
// ---------------
#define WIRE_INTERFACES_COUNT 1
#define PIN_WIRE1_SCL         3u // PA_18
#define PIN_WIRE1_SDA         4u // PA_23

// Serial ports
// ------------
#define SERIAL_INTERFACES_COUNT 1
#define PIN_SERIAL0_CTS         1u // PA_19
#define PIN_SERIAL0_RX          3u // PA_18
#define PIN_SERIAL0_TX          4u // PA_23
